docs: render mermaid diagrams in vitepress
